GeFengthe/RTL8762/src/ble/profile/server/rcu_dfu_service.c
    }
}

/**
 * @brief silence_BufferCheckProc
 *
 * @param _mBufferSize     size for buffer check.
 * @param _mCrc            calced buffer crc value.
 * @return None
*/
void silence_BufferCheckProc(uint16_t _mBufferSize, uint16_t _mCrc) DATA_RAM_FUNCTION;
void silence_BufferCheckProc(uint16_t _mBufferSize, uint16_t _mCrc)
{
    uint16_t offset = 0;
    uint8_t notif_data[7] = {0};
    notif_data[0] = DFU_OPCODE_NOTIF;
    notif_data[1] = DFU_OPCODE_REPORT_BUFFER_CRC;

    if (mBufSize > DFU_TEMP_BUFFER_SIZE)
    {
        //invalid para
        ota_tmp_buf_used_size = 0;
        notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
        LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
        server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }
    if (ota_tmp_buf_used_size == mBufSize ||
        dfuPara.nCurOffSet + ota_tmp_buf_used_size == dfuPara.image_total_length
       )
    {
        if (dfu_checkbufcrc(g_pOtaTempBufferHead, ota_tmp_buf_used_size, _mCrc))     //crc error

        {
            ota_tmp_buf_used_size = 0;
            notif_data[2] = DFU_ARV_FAIL_CRC_ERROR;
            LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
            server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                             notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
            return;
        }

        else //crc ok
        {
            if (OTP->ota_with_encryption_data)
            {
                //aes
                do
                {
                    if ((ota_tmp_buf_used_size - offset) >= 16)
                    {
#if defined ( __ICCARM__   )
#pragma diag_suppress=Pa039
#endif
                        hw_aes_init(OTP->aes_key, NULL, AES_MODE_ECB, OTP->ota_with_encryption_use_aes256);
#if defined ( __ICCARM__   )
#pragma diag_warning=Pa039
#endif
                        hw_aes_decrypt_16byte(g_pOtaTempBufferHead + offset, g_pOtaTempBufferHead + offset);
                        offset += 16;
                    }
                    else
                    {
                        break;
                    }
                }
                while (1);
            }
            unlock_flash_all();
            DFU_PRINT_TRACE1(" p_dfu->cur_offset, %x", dfuPara.nCurOffSet);

            uint32_t result = sil_dfu_update(dfuPara.signature, dfuPara.nCurOffSet, ota_tmp_buf_used_size,
                                             (uint32_t *)g_pOtaTempBufferHead);

            if (result == 0)
            {
                dfuPara.nCurOffSet += ota_tmp_buf_used_size;

                if ((dfuPara.nCurOffSet - gSilDfuResendOffset) >= SECTOR_SIZE)
                {
                    gSilDfuResendOffset += SECTOR_SIZE;
                }
                ota_tmp_buf_used_size = 0;
                notif_data[2] = DFU_ARV_SUCCESS; //valid
                LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
                server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
                lock_flash();
                return;
            }
            else
            {
                uint32_t ret = 0;
                uint32_t cnt = 0;
                do
                {
                    sil_dfu_flash_erase(dfuPara.signature, gSilDfuResendOffset);
                    //delay_ms_asm(200);
                    ret = dfu_flash_check_blank(dfuPara.signature, gSilDfuResendOffset, SECTOR_SIZE);
                    if (ret)
                    {
                        cnt++;
                    }
                    else
                    {
                        break;
                    }
                    if (cnt >= 3)     //check 0xff failed,erase failed
                    {
                        //erase error
                        ota_tmp_buf_used_size = 0;
                        dfuPara.nCurOffSet =  gSilDfuResendOffset;
                        notif_data[2] = DFU_ARV_FAIL_ERASE_ERROR;
                        LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
                        server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                         notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
                        lock_flash();
                        return;
                    }
                }
                while (1);

                if ((dfuPara.nCurOffSet - gSilDfuResendOffset) > SECTOR_SIZE) //need erase two sector
                {
                    cnt = 0;
                    do
                    {
                        //erase sector :addr ~ gDfuResendOffset+SECTOR_SIZE;
                        dfu_flash_erase(dfuPara.signature, gSilDfuResendOffset + SECTOR_SIZE);
                        ret = dfu_flash_check_blank(dfuPara.signature, gSilDfuResendOffset + SECTOR_SIZE, SECTOR_SIZE);
                        if (ret)
                        {
                            cnt++;
                        }
                        else
                        {
                            break;
                        }
                        if (cnt >= 3)     //check 0xff failed,erase failed
                        {
                            //erase error
                            ota_tmp_buf_used_size = 0;
                            dfuPara.nCurOffSet =  gSilDfuResendOffset;
                            notif_data[2] = DFU_ARV_FAIL_ERASE_ERROR;
                            LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
                            server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                             notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
                            lock_flash();
                            return;
                        }
                    }
                    while (1);
                }
                //erase ok
                ota_tmp_buf_used_size = 0;
                dfuPara.nCurOffSet =  gSilDfuResendOffset;
                notif_data[2] = DFU_ARV_FAIL_PROG_ERROR;
                LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
                server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
                lock_flash();
                return;
            }
        }
    }
    else
    {
        DFU_PRINT_TRACE2("ota_temp_buf_used_size is %d,_mBufferSize=%d", ota_tmp_buf_used_size,
                         _mBufferSize);
        //flush buffer.
        ota_tmp_buf_used_size = 0;
        notif_data[2] = DFU_ARV_FAIL_LENGTH_ERROR;
        LE_UINT32_TO_ARRAY(&notif_data[3], dfuPara.nCurOffSet);
        server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, 7, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }
}


/**
 * @brief silence_dfu_service_handle_packet_req
 *
 * @param length     data reviewed length.
 * @param p_value    data receive point address.
 * @return None
*/
void silence_dfu_service_handle_packet_req(uint16_t length, uint8_t *p_value) DATA_RAM_FUNCTION;
void silence_dfu_service_handle_packet_req(uint16_t length, uint8_t *p_value)
{
    DFU_PRINT_TRACE4("dfu_service_handle_packet_req: length=%d, cur_offset =%d, ota_temp_buf_used_size = %d,image_total_length= %d",
                     length,
                     dfuPara.nCurOffSet,
                     ota_tmp_buf_used_size,
                     dfuPara.image_total_length
                    );

#if OTA_BUF_CHECK_EN
    {
        if (ota_tmp_buf_used_size + length > DFU_TEMP_BUFFER_SIZE)
        {
            DFU_PRINT_ERROR2("====>dfu_service_handle_packet_req: buffer overflow! ota_tmp_buf_used_size=%d, max_buffer_size=%d",
                             ota_tmp_buf_used_size + length, DFU_TEMP_BUFFER_SIZE);
            dfu_fw_active_reset();
        }
        memcpy(g_pOtaTempBufferHead + ota_tmp_buf_used_size, p_value, length);
        ota_tmp_buf_used_size += length;
    }
#else
    /*when disable buffer check, client send 20bytes per packet*/
    uint32_t max_buffer_size = DFU_TEMP_BUFFER_SIZE - (DFU_TEMP_BUFFER_SIZE % 20);
    /*check memcpy buffer boundary*/
    if (ota_tmp_buf_used_size + length > max_buffer_size)
    {
        DFU_PRINT_ERROR2("====>dfu_service_handle_packet_req: buffer overflow! ota_tmp_buf_used_size=%d, max_buffer_size=%d",
                         ota_tmp_buf_used_size + length, max_buffer_size);
        dfu_fw_active_reset();
    }

    /*check total length*/
    if (dfuPara.nCurOffSet + ota_tmp_buf_used_size + length > dfuPara.image_total_length)
    {
        DFU_PRINT_TRACE4("dfu_service_handle_packet_req: p_dfu->cur_offset=%d, ota_temp_buf_used_size =%d, length= %d, image_total_length = %d ",
                         dfuPara.nCurOffSet,
                         ota_tmp_buf_used_size,
                         length,
                         dfuPara.image_total_length
                        );

        dfu_fw_active_reset();
    }

    if (length >= 16)
    {
        if (OTP->ota_with_encryption_data)
        {
            uint16_t offset = 0;
            do
            {
                if ((length - offset) >= 16)
                {
                    hw_aes_init(OTP->aes_key, NULL, AES_MODE_ECB, OTP->ota_with_encryption_use_aes256);
                    hw_aes_decrypt_16byte(p_value + offset, p_value + offset);
                    offset += 16;
                }
                else
                {
                    break;
                }
            }
            while (1);
        }
    }

    memcpy(g_pOtaTempBufferHead + ota_tmp_buf_used_size, p_value, length);
    ota_tmp_buf_used_size += length;

    if (ota_tmp_buf_used_size == (DFU_TEMP_BUFFER_SIZE - DFU_TEMP_BUFFER_SIZE % 20) ||
        dfuPara.nCurOffSet + ota_tmp_buf_used_size == dfuPara.image_total_length
       )
    {
        unlock_flash_all();
        if (sil_dfu_update(dfuPara.signature, dfuPara.nCurOffSet, ota_tmp_buf_used_size,
                           (uint32_t *)g_pOtaTempBufferHead) == 0)
        {
            lock_flash();
            dfuPara.nCurOffSet += ota_tmp_buf_used_size;
            ota_tmp_buf_used_size = 0;
        }
        else
        {
            /*eflash write fail, we should restart ota procedure.*/
            lock_flash();
            dfu_reset(dfuPara.signature);
            dfu_fw_active_reset();
        }
    }
#endif
}

/**
 * @brief write characteristic data from service.
 *
 * @param ServiceID          ServiceID to be written.
 * @param iAttribIndex       Attribute index of characteristic.
 * @param wLength            length of value to be written.
 * @param pValue             value to be written.
 * @return Profile procedure result
*/
T_APP_RESULT dfu_attr_write_cb(uint8_t conn_id, uint8_t service_id,
                               uint16_t attrib_index,
                               T_WRITE_TYPE write_type,
                               uint16_t length, uint8_t *p_value,
                               P_FUN_WRITE_IND_POST_PROC *p_write_ind_post_proc) DATA_RAM_FUNCTION;
T_APP_RESULT dfu_attr_write_cb(uint8_t conn_id, uint8_t service_id,
                               uint16_t attrib_index,
                               T_WRITE_TYPE write_type,
                               uint16_t length, uint8_t *p_value, P_FUN_WRITE_IND_POST_PROC *p_write_ind_post_proc)
{
    T_APP_RESULT  wCause = APP_RESULT_SUCCESS;

    RESET_TIME_OUT_TIMER();

